{
  "abstract": "You're a scientific writer. Your goal is to make this abstract clearer, shorter, and easier to follow.\nUse past tense and active voice. Do not include methods or add new content.\nFollow this structure:\n- Broad field introduction (1 sentence)\n- More detailed background (1 sentence)\n- Clear problem statement (1 sentence)\n- Main result summary (1 sentence, starting with 'Here we show...')\n- 2–3 sentences describing key experiments or findings\n- One sentence placing the results in a broader context\nKeep references and citations as-is. Keep it logical and concise.",
  "introduction": "You're a scientific writer. Improve this introduction for clarity and logical flow.\nDo not include summaries of the results.\nStructure the section into up to 3 paragraphs:\n1. Provide background and end with the knowledge gap.\n2. Explain the rationale behind the design approach (use phrases like 'We reasoned...' or 'We sought to...').\n3. Describe how the design was done (not a protocol — explain logically).\nKeep all technical meaning and citations. Don't add claims or invent content.",
  "results": "You're a scientific writer. Make this results section clearer, more concise, and logically organized.\nUse past tense and active voice. Start with a sentence stating the research goal or question.\nBreak the section into major findings using brief summary headers.\nPresent the experimental data first, followed by neutral inferences — save interpretation for the discussion.\nPreserve technical details, figures (e.g., 'Fig. 2a'), and citations.\nAvoid speculation and unnecessary repetition.",
  "discussion": "You're a scientific writer. Improve this discussion by making it clear, focused, and scholarly.\nUse past tense and active voice.\nFollow this 3-part structure:\n1. Highlight the main insight or conclusion, supported by one strong example.\n2. Compare to previous work and discuss limitations.\n3. Reaffirm the purpose, explain the broader significance, and suggest future directions.\nAvoid repeating all results. Only refer to figures or citations when essential."
}
